package leetcode.java.backtracking.SudokuSolver;

/* 37. Sudoku Solver
https://leetcode.com/problems/sudoku-solver/description/

Напишите программу, решающую судоку, заполняя пустые ячейки.

Решение судоку должно удовлетворять всем следующим правилам:

Каждая из цифр 1–9 должна встречаться ровно один раз в каждой строке.
Каждая из цифр 1–9 должна встречаться ровно один раз в каждом столбце.
Каждая из цифр 1–9 должна встретиться ровно один раз в каждом из 9 подполей сетки размером 3x3.
'.' символ указывает на пустые ячейки.

Input: board = [["5","3",".",".","7",".",".",".","."],["6",".",".","1","9","5",".",".","."],[".","9","8",".",".",".",".","6","."],["8",".",".",".","6",".",".",".","3"],["4",".",".","8",".","3",".",".","1"],["7",".",".",".","2",".",".",".","6"],[".","6",".",".",".",".","2","8","."],[".",".",".","4","1","9",".",".","5"],[".",".",".",".","8",".",".","7","9"]]
Output: [["5","3","4","6","7","8","9","1","2"],["6","7","2","1","9","5","3","4","8"],["1","9","8","3","4","2","5","6","7"],["8","5","9","7","6","1","4","2","3"],["4","2","6","8","5","3","7","9","1"],["7","1","3","9","2","4","8","5","6"],["9","6","1","5","3","7","2","8","4"],["2","8","7","4","1","9","6","3","5"],["3","4","5","2","8","6","1","7","9"]]
*/

public class SudokuSolver {
    public static void main(String[] args) {
        char[][] board = {
                {'5', '3', '.', '.', '7', '.', '.', '.', '.'},
                {'6', '.', '.', '1', '9', '5', '.', '.', '.'},
                {'.', '9', '8', '.', '.', '.', '.', '6', '.'},
                {'8', '.', '.', '.', '6', '.', '.', '.', '3'},
                {'4', '.', '.', '8', '.', '3', '.', '.', '1'},
                {'7', '.', '.', '.', '2', '.', '.', '.', '6'},
                {'.', '6', '.', '.', '.', '.', '2', '8', '.'},
                {'.', '.', '.', '4', '1', '9', '.', '.', '5'},
                {'.', '.', '.', '.', '8', '.', '.', '7', '9'}
        };

        solveSudoku(board);

        // Вывод решённой доски
        for (char[] row : board) {
            System.out.println(row);
        }
    }

    /**
     * Решает переданную доску Sudoku, изменяя исходный массив.
     * Использует алгоритм DFS с backtracking для подбора цифр.
     * <p>
     * Time: O(9^(n*n)) в худшем случае, где n=9.
     * На практике значительно быстрее благодаря прунингу (раннему отсечению неверных ветвей).
     * Для фиксированного размера 9×9 можно считать O(1).
     * Space: O(1) для хранения доски (фиксированный размер 9×9).
     * O(81) = O(1) для стека рекурсии в худшем случае (все клетки пустые).
     *
     * @param board доска Sudoku 9×9, где '.' обозначает пустую клетку
     */
    public static void solveSudoku(char[][] board) {
        dfs(board, 0, 0);
    }

    /**
     * Проверяет, можно ли разместить цифру value в клетке (row, col),
     * не нарушая правил Sudoku (уникальность в строке, столбце и блоке 3×3).
     * <p>
     * Time: O(1) — всегда проверяется ровно 27 клеток (9+9+9).
     * Space: O(1) — без дополнительной памяти.
     *
     * @param board текущее состояние доски
     * @param row   индекс строки
     * @param col   индекс столбца
     * @param value цифра для проверки ('1'–'9')
     * @return true, если размещение допустимо
     */
    private static boolean isValid(char[][] board, int row, int col, char value) {
        // Проверяем строку
        for (int c = 0; c < 9; c++) {
            if (board[row][c] == value) {
                return false;
            }
        }

        // Проверяем столбец
        for (int r = 0; r < 9; r++) {
            if (board[r][col] == value) {
                return false;
            }
        }

        // Проверяем подблок 3×3
        int startRow = (row / 3) * 3;
        int startCol = (col / 3) * 3;
        for (int r = startRow; r < startRow + 3; r++) {
            for (int c = startCol; c < startCol + 3; c++) {
                if (board[r][c] == value) {
                    return false;
                }
            }
        }

        return true;
    }

    /**
     * Рекурсивная функция с возвратом (backtracking) для решения Sudoku.
     * Последовательно перебирает пустые клетки и пробует цифры от 1 до 9.
     * <p>
     * Time: O(9^(empty_cells)) в худшем случае, но с эффективным прунингом.
     * Space: O(empty_cells) для глубины рекурсии.
     *
     * @param board текущее состояние доски
     * @param row   текущая строка
     * @param col   текущий столбец
     * @return true, если решение найдено; false, если нужно откатиться
     */
    private static boolean dfs(char[][] board, int row, int col) {
        // Базовый случай: прошли всю доску — решение найдено
        if (row == 9) {
            return true;
        }
        // Переход на следующую строку, если достигли конца текущей
        if (col == 9) {
            return dfs(board, row + 1, 0);
        }
        // Пропускаем уже заполненные клетки
        if (board[row][col] != '.') {
            return dfs(board, row, col + 1);
        }

        // Пробуем цифры от '1' до '9'
        for (char num = '1'; num <= '9'; num++) {
            if (isValid(board, row, col, num)) {
                board[row][col] = num;  // Делаем выбор
                if (dfs(board, row, col + 1)) {
                    return true;  // Решение найдено
                }
                board[row][col] = '.';  // Откат (backtrack)
            }
        }
        return false;  // Ни одна цифра не подошла — нужно откатиться
    }
}
