package hashing.ValidSudoku;

import java.util.HashSet;
import java.util.Set;

/* 36. Valid Sudoku
https://leetcode.com/problems/valid-sudoku/description/

Определите, действительна ли доска для судоку 9 x 9. Только заполненные ячейки подлежат проверке согласно следующим
правилам:

Каждая строка должна содержать цифры от 1 до 9 без повторений.
Каждый столбец должен содержать цифры 1–9 без повторений.
Каждый из девяти подполей сетки размером 3х3 должен содержать цифры от 1 до 9 без повторений.

Примечание:
Доска судоку (частично заполненная) может быть допустимой, но не обязательно решаемой.
Только заполненные ячейки должны быть проверены в соответствии с указанными правилами.

Input: board =
[["5","3",".",".","7",".",".",".","."]
,["6",".",".","1","9","5",".",".","."]
,[".","9","8",".",".",".",".","6","."]
,["8",".",".",".","6",".",".",".","3"]
,["4",".",".","8",".","3",".",".","1"]
,["7",".",".",".","2",".",".",".","6"]
,[".","6",".",".",".",".","2","8","."]
,[".",".",".","4","1","9",".",".","5"]
,[".",".",".",".","8",".",".","7","9"]]
Output: true

Input: board =
[["8","3",".",".","7",".",".",".","."]
,["6",".",".","1","9","5",".",".","."]
,[".","9","8",".",".",".",".","6","."]
,["8",".",".",".","6",".",".",".","3"]
,["4",".",".","8",".","3",".",".","1"]
,["7",".",".",".","2",".",".",".","6"]
,[".","6",".",".",".",".","2","8","."]
,[".",".",".","4","1","9",".",".","5"]
,[".",".",".",".","8",".",".","7","9"]]
Output: false
*/

public class ValidSudoku {
    public static void main(String[] args) {
        char[][] board = {
            {'5', '3', '.', '.', '7', '.', '.', '.', '.'},
            {'6', '.', '.', '1', '9', '5', '.', '.', '.'},
            {'.', '9', '8', '.', '.', '.', '.', '6', '.'},
            {'8', '.', '.', '.', '6', '.', '.', '.', '3'},
            {'4', '.', '.', '8', '.', '3', '.', '.', '1'},
            {'7', '.', '.', '.', '2', '.', '.', '.', '6'},
            {'.', '6', '.', '.', '.', '.', '2', '8', '.'},
            {'.', '.', '.', '4', '1', '9', '.', '.', '5'},
            {'.', '.', '.', '.', '8', '.', '.', '7', '9'},
        };

        System.out.println(isValidSudoku(board)); // true
    }

    // isValidSudoku проверяет, является ли переданная доска валидной по правилам Sudoku.
    // time complexity: O(1) - 9x9, space complexity: O(1) - 9x9
    private static boolean isValidSudoku(char[][] board) {
        int boardSize = board.length; // Всегда 9 для стандартного судоку

        // Создаем массивы множеств для отслеживания чисел в строках, столбцах и блоках 3x3
        // В Java нельзя напрямую создать массив обобщённых типов, поэтому используем приведение типов
        @SuppressWarnings("unchecked")
        Set<Character>[] rows = new Set[boardSize];
        @SuppressWarnings("unchecked")
        Set<Character>[] cols = new Set[boardSize];
        @SuppressWarnings("unchecked")
        Set<Character>[] boxes = new Set[boardSize];

        // Инициализируем множества
        for (int i = 0; i < boardSize; i++) {
            rows[i] = new HashSet<>();
            cols[i] = new HashSet<>();
            boxes[i] = new HashSet<>();
        }

        // Проходим по всем ячейкам доски
        for (int r = 0; r < boardSize; r++) {
            for (int c = 0; c < boardSize; c++) {
                char val = board[r][c];

                // Пропускаем пустые ячейки
                if (val == '.') {
                    continue;
                }

                // Вычисляем индекс блока 3x3 (от 0 до 8)
                int boxIndex = (r / 3) * 3 + (c / 3);

                // Проверяем, встречалось ли число в текущей строке, столбце или блоке
                if (rows[r].contains(val) || cols[c].contains(val) || boxes[boxIndex].contains(val)) {
                    return false;
                }

                // Добавляем число в соответствующие множества (аналог присваивания true в мапе)
                rows[r].add(val);
                cols[c].add(val);
                boxes[boxIndex].add(val);
            }
        }

        return true;
    }
}
