package main

import (
	"fmt"
	"sort"
)

/* https://leetcode.com/problems/car-fleet/description/

На расстоянии заданной мили от начальной мили 0 находится n автомобилей, которые едут, чтобы достичь целевой мили.
Вам заданы два целочисленных массива: позиция и скорость, оба длиной n, где позиция[i] — это стартовая миля i-го
автомобиля, а скорость[i] — скорость i-го автомобиля в милях в час.
Автомобиль не может обогнать другую машину, но может догнать ее и затем поехать рядом со скоростью более медленной
машины.
Автопарк – это автомобиль или автомобили, едущие рядом друг с другом. Скорость автопарка – это минимальная скорость
любого автомобиля в парке.
Если автомобиль догоняет автопарк на заданной миле, он все равно будет считаться частью автопарка.
Верните количество автопарков, которые прибудут в пункт назначения.

Input: target = 12, position = [10,8,0,5,3], speed = [2,4,1,1,3]
Output: 3
Explanation:
Автомобили, начинающиеся с 10 (скорость 2) и 8 (скорость 4), становятся автопарком, встречаясь друг с другом на 12.
Парк формируется у цели.
Автомобиль, стартующий с 0 (скорость 1), не догоняет ни один другой автомобиль, поэтому он сам по себе является
автопарком.
Автомобили, начинающиеся со скорости 5 (скорость 1) и 3 (скорость 3), становятся автопарком, встречаясь друг с другом на
скорости 6. Автопарк движется со скоростью 1, пока не достигнет цели.
*/

func main() {
	position := []int{10, 8, 0, 5, 3}
	speed := []int{2, 4, 1, 1, 3}
	fmt.Println(carFleet(12, position, speed)) // 3
}

func carFleet(target int, position []int, speed []int) int {
	// Создаем пары позиция-скорость
	pairs := make([][2]int, len(position))
	for i := 0; i < len(position); i++ {
		pairs[i] = [2]int{position[i], speed[i]}
	}

	// Сортируем по позиции в порядке убывания
	sort.Slice(pairs, func(i, j int) bool {
		return pairs[i][0] > pairs[j][0]
	})

	stack := []float64{}
	for _, pair := range pairs {
		pos, spd := pair[0], pair[1]
		time := float64(target-pos) / float64(spd)

		if len(stack) == 0 || time > stack[len(stack)-1] {
			stack = append(stack, time)
		}
	}

	return len(stack)
}
